OpenFOAM-2.3.0/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/0/pyrolysisRegion/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type            empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offset          (0 0 0);
        fieldName       Qr; // this is the name of Qr field in region0
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
